app/controllers/categories_controller.rb

SELECT * FROM `categories`
---
  def index
    @categories = Category.all

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def show
    @category = Category.find params[:id]

INSERT INTO `categories` (`name`, `updated_at`, `created_at`) VALUES('categoria 1', '2010-03-11 18:17:06', '2010-03-11 18:17:06')
---
  def create
    @category = Category.new params[:category]
    if @category.save

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def edit
    @category = Category.find params[:id]