app/controllers/tasks_controller.rb

SELECT * FROM `tasks`
---
  def index
    @tasks = Task.all

INSERT INTO `tasks` (`name`, `start_date`, `end_date`, `updated_at`, `body`, `category_id`, `finished`, `created_at`) VALUES('tarea ', NULL, NULL, '2010-03-11 15:31:01', NULL, NULL, NULL, '2010-03-11 15:31:01')
---
  def create
    @task = Task.new params[:task]
    if @task.save

UPDATE `tasks` SET `updated_at` = '2010-03-11 15:37:17', `name` = 'tarea 2' WHERE `id` = 3
---
  def update
    @task.update_attributes params[:task]

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
DELETE FROM `tasks` WHERE `id` = 1
---
  def destroy
    @task = Task.find params[:id]
    @task.destroy

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 3)
---
    def find_task
      @task = Task.find params[:id]